[
  {
    "content": [
      "Nearly 2 years of experience with React. I have built several projects with it, and have used it in conjunction with Next.js for the past year.",
      "1 year of experience using React with TypeScript"
    ],
    "imgSrc": "react",
    "title": "React JS"
  },
  {
    "content": [
      "Familiar with new Nextjs features such as the App Router.",
      "1 year of experience building Next.js applications, all of which are written in TypeScript.",
      "The only Next.js project I have made public is the blog above in the 'Projects' section. I have built several other projects with Next.js and have tried to cover as many of the features as possible."
    ],
    "imgSrc": "next",
    "title": "Next.js"
  },
  {
    "content": [
      "1 year of experience with Typescript. Have used it exclusively for that time, and have gotten familiar with the majority of its intricacies both in conjunction with React and Vanilla JS.",
      "Published two NPM packages using Typescript, neither are very popular but I believe the monthpicker in particular is a good representation of my current skill level and understaning of TS."
    ],
    "imgSrc": "typescript",
    "title": "TypeScript"
  },
  {
    "content": [
      "3 years of experience with Vanilla JS. Prioritized building a foundation through Vanilla and spent the first 2 years of my learning using it exclusively.",
      "Mainly use it for small projects and scripts now but I am still very comfortable with it and am more than willing to take on a project that requires it.",
      "All of my vanilla projects are written from scratch without any boilerplate or tooling, including this portfolio and the google calendar clone in the 'Projects' section."
    ],
    "imgSrc": "vanilla",
    "title": "Vanilla JS"
  },
  {
    "content": [
      "Automation is important to me, unfortunately there are not many tools I'm aware of that are great at it. I have been honing with Node for a year now and have built several CLI tools to automate various tasks.",
      "I do not publicly share the majority of these tools, but I will leave them in whatever project I am working on that requires them. This portfolio for example hass a CLI Image Handling Script that automates several annoying tasks relative to image handling such as resizing, applying filters, converting to webp, creating queries, data URIs, and more."
    ],
    "imgSrc": "node",
    "title": "Node JS"
  },
  {
    "content": [
      "I have over 5 years of experience with CSS, enough to know how to re-create any design so long as it doesn't involve canvas magic.",
      "Am open to using any CSS framework or tooling, some of the ones I am familiar with are: Bootstrap, Tailwind, and Module CSS.",
      "My eye for design is not great, but I have a keen eye for detail and am adept at identifying UX issues."
    ],
    "imgSrc": "css",
    "title": "CSS"
  },
  {
    "content": [
      "2 years of experience with Webpack.",
      "Familiar with all of the core loading and optimization features in standard webpack.",
      "Have explored many of the more advanced features such as code splitting, tree shaking, and module federation.",
      "Make it a habit to try out different configurations with each new project. For example, this portfolio utilizes a very underrated plugin called 'html-bundler-webpack-plugin' which allows you to resolve images, fonts, css, and js files from your html files."
    ],
    "imgSrc": "webpack",
    "title": "Webpack"
  }
]