[
  {
    "content": [
      "Nearly 2 years of experience with React, the last year of which has been exclusively with TypeScript.",
      "Capable of building apps from the ground up, and do not rely on any libraries or third party packages to do so.",
      "I've invested a lot of time into learning how React works, and through doing so have refined my approach to get the most out off performance and maintainability. All of my projects are built with the same approach, I prioritize finding the right answer when it comes to React, not the easiest."
    ],
    "imgSrc": "react",
    "title": "React JS"
  },
  {
    "content": [
      "1 year of experience building Next.js applications, all of which are written in TypeScript.",
      "Well-versed in the majority of Next.js features, both new and old.",
      "Have built dozens of projects with Next.js and have carefully refined my approach to get the most out of the framework. My most recent project is a blog built from scratch meant to demonstrate my current skill level, it is featured in the 'Projects' section."
    ],
    "imgSrc": "next",
    "title": "Next.js"
  },
  {
    "content": [
      "1 year of experience with Typescript. Have used it exclusively for that time, and have gotten familiar with the majority of its intricacies both in conjunction with React and Vanilla JS.",
      "Published two NPM packages using Typescript, neither are very popular but I believe the monthpicker in particular is a good representation of my current skill level and understaning of TS."
    ],
    "imgSrc": "typescript",
    "title": "TypeScript"
  },
  {
    "content": [
      "3 years of experience with Vanilla JS. Prioritized building a foundation through Vanilla and spent the first 2 years of my learning using it exclusively.",
      "Mainly use it for small projects and scripts now but I am still very comfortable with it and am more than willing to take on a project that requires it.",
      "All of my vanilla projects are written from scratch without any boilerplate or tooling, including this portfolio and the google calendar clone in the 'Projects' section."
    ],
    "imgSrc": "vanilla",
    "title": "Vanilla JS"
  },
  {
    "content": [
      "1.5 years of experience with Node JS. I use it for all of my automation and have built dozens of CLI tools with it. Normally I will not share these tools publicly but I left an example of one in this project that handles image optimization, resizing, compression, and more.",
      "I have not attempted any backend development with Node nor do I plan to. I use it exclusively to refine my workflow and worth with the file system."
    ],
    "imgSrc": "node",
    "title": "Node JS"
  },
  {
    "content": [
      "Over 5 years of experience with CSS, enough to know how to re-create any design so long as it doesn't involve canvas magic.",
      "Am open to using any CSS framework or tooling, some of the ones I am familiar with are: Bootstrap, Tailwind, and Module CSS.",
      "Familiar and proficient with recreating designs from Figma, Adobe XD, or any other design tool. I am not great at designing myself due to how long it takes me, but if necessary I can do it, an example being this portfolio."
    ],
    "imgSrc": "css",
    "title": "CSS"
  },
  {
    "content": [
      "2 years of experience with Webpack.",
      "Familiar with all of the core loading and optimization features in standard webpack.",
      "Have explored many of the more advanced features such as code splitting, tree shaking, and module federation.",
      "Lots of experience debugging webpack issues, and have a good understanding of how to resolve them, and how to avoid them all together."
    ],
    "imgSrc": "webpack",
    "title": "Webpack"
  }
]